todo/app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at", "completed_at") VALUES (?, ?, ?, ?, ?)  [["content", "night"], ["todo_list_id", 3], ["created_at", "2022-01-04 13:55:10.938337"], ["updated_at", "2022-01-04 13:55:10.938337"], ["completed_at", nil]]
---
    def create
     @todo_item = @todo_list.todo_items.create(todo_item_params)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 3], ["id", 1], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
    def destroy
        @todo_item = @todo_list.todo_items.find(params[:id])
        if @todo_item.destroy

UPDATE "todo_items" SET "updated_at" = ?, "completed_at" = ? WHERE "todo_items"."id" = ?  [["updated_at", "2022-01-04 13:55:13.574278"], ["completed_at", "2022-01-04 13:55:13.573515"], ["id", 4]]
---
    def complete
        @todo_item.update_attribute(:completed_at, Time.now)